cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF11xK.svd
        <!-- REGISTER "DMACDA1" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA1</name>
          <description>Transfer Destination Address Register 1</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "DMACA2" -->
        <register derivedFrom="DMACA0">
          <name>DMACA2</name>
          <description>Configuration A Register 2</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "DMACB2" -->
        <register derivedFrom="DMACB0">
          <name>DMACB2</name>
          <description>Configuration B Register 2</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "DMACSA2" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA2</name>
          <description>Transfer Source Address Register 2</description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "DMACDA2" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA2</name>
          <description>Transfer Destination Address Register 2</description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "DMACA3" -->
        <register derivedFrom="DMACA0">
          <name>DMACA3</name>
          <description>Configuration A Register 3</description>
          <addressOffset>0x40</addressOffset>
        </register>
        <!-- REGISTER "DMACB3" -->
        <register derivedFrom="DMACB0">
          <name>DMACB3</name>
          <description>Configuration B Register 3</description>
          <addressOffset>0x44</addressOffset>
        </register>
        <!-- REGISTER "DMACSA3" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA3</name>
          <description>Transfer Source Address Register 3</description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "DMACDA3" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA3</name>
          <description>Transfer Destination Address Register 3</description>
          <addressOffset>0x4C</addressOffset>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>
